In [265]:
import pymysql
import sqlalchemy as alch
from getpass import getpass
import pandas as pd
import random

In [266]:
df = pd.read_csv("healthcare_dataset.csv")

In [267]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                10000 non-null  object
 1   Age                 10000 non-null  int64
 2   Gender              10000 non-null  object
 3   Blood Type          10000 non-null  object
 4   Medical Condition   10000 non-null  object
 5   Date of Admission   10000 non-null  object
 6   Doctor              10000 non-null  object
 7   Hospital            10000 non-null  object
 8   Insurance Provider  10000 non-null  object
 9   Billing Amount      10000 non-null  float64
 10  Room Number         10000 non-null  int64
 11  Admission Type      10000 non-null  object
 12  Discharge Date      10000 non-null  object
 13  Medication          10000 non-null  object
 14  Test Results        10000 non-null  object
dtypes: float64(1), int64(2), object(12)
memory usage: 1.1+ MB

In [268]:
df.head()

,Name,Age,Gender,Blood Type,Medical Condition,Date of Admission,Doctor,Hospital,Insurance Provider,Billing Amount,Room Number,Admission Type,Discharge Date,Medication,Test Results
0,Tiffany Ramirez,81,Female,O-,Diabetes,2022-11-17,Patrick Parker,Wallace-Hamilton,Medicare,37490.983364,146,Elective,2022-12-01,Aspirin,Inconclusive
1,Ruben Burns,35,Male,O+,Asthma,2023-06-01,Diane Jackson,"Burke, Griffin and Cooper",UnitedHealthcare,47304.064845,404,Emergency,2023-06-15,Lipitor,Normal
2,Chad Byrd,61,Male,B-,Obesity,2019-01-09,Paul Baker,Walton LLC,Medicare,36874.896997,292,Emergency,2019-02-08,Lipitor,Normal
3,Antonio Frederick,49,Male,B-,Asthma,2020-05-02,Brian Chandler,Garcia Ltd,Medicare,23303.322092,480,Urgent,2020-05-03,Penicillin,Abnormal
4,Mrs. Brandy Flowers,51,Male,O-,Arthritis,2021-07-09,Dustin Griffin,"Jones, Brown and Murray",UnitedHealthcare,18086.344184,477,Urgent,2021-08-02,Paracetamol,Normal

In [269]:
df['Medical Condition'].unique()

array(['Diabetes', 'Asthma', 'Obesity', 'Arthritis', 'Hypertension',
       'Cancer'], dtype=object)

In [270]:
df.rename(columns={"Blood Type": "blood_type"}, inplace=True)
df.rename(columns={"Medical Condition": "medical_cond"}, inplace=True)
df.rename(columns={"Hospital": "hospital"}, inplace=True)
df.rename(columns={"Doctor": "doctor"}, inplace=True)
df.rename(columns={"Medication": "medication"}, inplace=True)
df.rename(columns={"Test Results": "test_result"}, inplace=True)
df.rename(columns={"Admission Type": "admission_type"}, inplace=True)
df.rename(columns={"Billing Amount": "billing_amount"}, inplace=True)
df.rename(columns={"Date of Admission": "adm_date"}, inplace=True)
df.rename(columns={"Discharge Date": "disc_date"}, inplace=True)
df.rename(columns={"Room Number": "room_number"}, inplace=True)
df.rename(columns={"Name": "name"}, inplace=True)
df.rename(columns={"Age": "age"}, inplace=True)
df.rename(columns={"Gender": "gender"}, inplace=True)
df.rename(columns={"Insurance Provider": "insurance_prov"}, inplace=True)

In [339]:
df.head()

,name,age,gender,blood_type,medical_cond,adm_date,doctor,hospital,insurance_prov,billing_amount,room_number,admission_type,disc_date,medication,test_result
0,Tiffany Ramirez,81,Female,O-,Diabetes,2022-11-17,Patrick Parker,Wallace-Hamilton,Medicare,18918,146,Elective,2022-12-01,Aspirin,Inconclusive
1,Ruben Burns,35,Male,O+,Asthma,2023-06-01,Diane Jackson,"Burke, Griffin and Cooper",UnitedHealthcare,23664,404,Emergency,2023-06-15,Lipitor,Normal
2,Chad Byrd,61,Male,B-,Obesity,2019-01-09,Paul Baker,Walton LLC,Medicare,29211,292,Emergency,2019-02-08,Lipitor,Normal
3,Antonio Frederick,49,Male,B-,Asthma,2020-05-02,Brian Chandler,Garcia Ltd,Medicare,28830,480,Urgent,2020-05-03,Penicillin,Abnormal
4,Mrs. Brandy Flowers,51,Male,O-,Arthritis,2021-07-09,Dustin Griffin,"Jones, Brown and Murray",UnitedHealthcare,12911,477,Urgent,2021-08-02,Paracetamol,Normal

In [338]:
df['billing_amount']=[random.randint(800,40000) for k in df.index]

#LET'S GET STARTED!

In [272]:
password= getpass("Por favor, introduce tu contraseña:") #ojo!!! nunca poner password tras crear esto porque se verá la contraseña!!!

In [273]:
dbName="healthcare"

In [274]:
# Connect to MySQL
conn = pymysql.connect(
    host='localhost',
    user='root',
    password=password,
    database='bank'
)

In [275]:
# Create a cursor object
cursor = conn.cursor()
# Create database
cursor.execute("CREATE DATABASE IF NOT EXISTS healthcare")
# Select the database
cursor.execute("USE healthcare")

0

In [276]:
create_patient_table = """
CREATE TABLE IF NOT EXISTS patient (
    pat_id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50),
    age INT,
    gender VARCHAR(50),
    blood_id INT,
    medcond_id INT ,
    FOREIGN KEY (blood_id) REFERENCES bloodtype(blood_id),
    FOREIGN KEY (medcond_id) REFERENCES medicalcond(medcond_id)
    )
"""

In [277]:
create_bloodtype_table = """
CREATE TABLE IF NOT EXISTS bloodtype (
    blood_id INT AUTO_INCREMENT PRIMARY KEY,
    blood_type VARCHAR(50) UNIQUE
    )
"""

In [278]:
create_medicalcond_table = """
CREATE TABLE IF NOT EXISTS medicalcond (
    medcond_id INT AUTO_INCREMENT PRIMARY KEY,
    medical_cond VARCHAR(50) UNIQUE
    )
"""

In [279]:
create_hospital_table = """
CREATE TABLE IF NOT EXISTS hospital (
    hospital_id INT AUTO_INCREMENT PRIMARY KEY,
    hospital VARCHAR(50),
    location VARCHAR(50)
    )
"""

In [280]:
create_doctor_table = """
CREATE TABLE IF NOT EXISTS doctor (
    doctor_id INT AUTO_INCREMENT PRIMARY KEY,
    doctor VARCHAR(50)
    )
"""

In [281]:
create_medication_table = """
CREATE TABLE IF NOT EXISTS medication (
    meds_id INT AUTO_INCREMENT PRIMARY KEY,
    medication VARCHAR(50) UNIQUE
    )
"""

In [282]:
create_testresults_table = """
CREATE TABLE IF NOT EXISTS test_results (
    testres_id INT AUTO_INCREMENT PRIMARY KEY,
    test_result VARCHAR(50) UNIQUE
    )
"""

In [283]:
create_admissiontype_table = """
CREATE TABLE IF NOT EXISTS admission_type (
    admtype_id INT AUTO_INCREMENT PRIMARY KEY,
    admission_type VARCHAR(50) 
    )
"""

In [284]:
create_insurance_provider_table = """
CREATE TABLE IF NOT EXISTS insurance_prov (
    insprov_id INT AUTO_INCREMENT PRIMARY KEY,
    insurance_prov VARCHAR(50)
    )
"""

In [285]:
create_admission_table = """
CREATE TABLE IF NOT EXISTS admission (
    adm_id INT AUTO_INCREMENT PRIMARY KEY,
    adm_date VARCHAR(50),
    disc_date VARCHAR(50),
    room_number INT,
    billing_amount FLOAT,
    doctor_id INT,
    hospital_id INT,
    admtype_id INT,
    pat_id INT,
    meds_id INT,
    testres_id INT,
    insprov_id INT,
    FOREIGN KEY (doctor_id) REFERENCES doctor(doctor_id),
    FOREIGN KEY (hospital_id) REFERENCES hospital(hospital_id),
    FOREIGN KEY (admtype_id) REFERENCES admission_type(admtype_id),
    FOREIGN KEY (pat_id) REFERENCES patient(pat_id),
    FOREIGN KEY (meds_id) REFERENCES medication(meds_id),
    FOREIGN KEY (testres_id) REFERENCES test_results(testres_id),
    FOREIGN KEY (insprov_id) REFERENCES insurance_prov(insprov_id)
    )
"""

In [286]:
cursor.execute(create_bloodtype_table)

0

In [287]:
cursor.execute(create_medicalcond_table)

0

In [288]:
cursor.execute(create_hospital_table)

0

In [289]:
cursor.execute(create_doctor_table)

0

In [290]:
cursor.execute(create_medication_table)

0

In [291]:
cursor.execute(create_testresults_table)

0

In [292]:
cursor.execute(create_admissiontype_table)

0

In [293]:
# Execute table creation queries
cursor.execute(create_patient_table)

0

In [294]:
cursor.execute(create_insurance_provider_table)

0

In [295]:
cursor.execute(create_admission_table)

0

#start populating!

In [296]:
df.sample()

,name,age,gender,blood_type,medical_cond,adm_date,doctor,hospital,insurance_prov,billing_amount,room_number,admission_type,disc_date,medication,test_result
6506,Larry Jensen,25,Female,B+,Arthritis,2020-09-01,Robert Williams,Juarez-Santiago,Aetna,11651.87808,195,Emergency,2020-09-19,Lipitor,Normal

In [297]:
bloodtype_data_unique_df=df.blood_type.unique()
bloodtype_data_unique_df

array(['O-', 'O+', 'B-', 'AB+', 'A+', 'AB-', 'A-', 'B+'], dtype=object)

In [298]:
bloodtype_df = pd.DataFrame(bloodtype_data_unique_df)
bloodtype_df.rename(columns={0: "blood_type"}, inplace=True)
bloodtype_df

  blood_type
0         O-
1         O+
2         B-
3        AB+
4         A+
5        AB-
6         A-
7         B+

In [299]:
connectionData=f"mysql+pymysql://root:{password}@localhost/healthcare"
engine = alch.create_engine(connectionData)

In [300]:
# Insert data into database
bloodtype_df.to_sql(name='bloodtype', con=engine, if_exists='append', index=False)

8

In [301]:
medical_cond_uniq=df.medical_cond.unique()
medical_cond_uniq

array(['Diabetes', 'Asthma', 'Obesity', 'Arthritis', 'Hypertension',
       'Cancer'], dtype=object)

In [302]:
medical_cond_uniq_df = pd.DataFrame(medical_cond_uniq)
medical_cond_uniq_df.columns=['medical_cond']
medical_cond_uniq_df

   medical_cond
0      Diabetes
1        Asthma
2       Obesity
3     Arthritis
4  Hypertension
5        Cancer

In [303]:
medical_cond_uniq_df.to_sql(name='medicalcond', con=engine, if_exists='append', index=False)

6

In [304]:
hospital_uniq=df.hospital.unique()
hospital_uniq

array(['Wallace-Hamilton', 'Burke, Griffin and Cooper', 'Walton LLC', ...,
       'Nash-Krueger', 'Wilson-Lyons', 'Torres, Young and Stewart'],
      dtype=object)

In [305]:
location_df = pd.read_csv('states.csv')
location_df['location']=[random.randint(0,50) for k in location_df.index]
location_df

#alternatively I can import it directly from the source: location_df = pd.read_csv('https://github.com/jasonong/List-of-US-States/raw/master/states.csv')

                   State Abbreviation  location
0                Alabama           AL         5
1                 Alaska           AK         7
2                Arizona           AZ        13
3               Arkansas           AR        17
4             California           CA        38
5               Colorado           CO        30
6            Connecticut           CT         6
7               Delaware           DE        33
8   District of Columbia           DC        18
9                Florida           FL        11
10               Georgia           GA        14
11                Hawaii           HI         1
12                 Idaho           ID        50
13              Illinois           IL        47
14               Indiana           IN        43
15                  Iowa           IA        12
16                Kansas           KS        44
17              Kentucky           KY        38
18             Louisiana           LA        34
19                 Maine           ME        32
20               Montana           MT        39
21              Nebraska           NE         7
22                Nevada           NV         4
23         New Hampshire           NH        33
24            New Jersey           NJ        48
25            New Mexico           NM         2
26              New York           NY        50
27        North Carolina           NC         5
28          North Dakota           ND        26
29                  Ohio           OH        29
30              Oklahoma           OK        21
31                Oregon           OR         9
32              Maryland           MD        19
33         Massachusetts           MA        11
34              Michigan           MI        34
35             Minnesota           MN        27
36           Mississippi           MS        37
37              Missouri           MO        30
38          Pennsylvania           PA         8
39          Rhode Island           RI        16
40        South Carolina           SC        19
41          South Dakota           SD        14
42             Tennessee           TN        16
43                 Texas           TX        48
44                  Utah           UT         2
45               Vermont           VT        28
46              Virginia           VA        14
47            Washington           WA        18
48         West Virginia           WV        34
49             Wisconsin           WI        19
50               Wyoming           WY        41

In [306]:
hospital_df = pd.DataFrame(hospital_uniq)
hospital_df.columns=['hospital']
hospital_df

                       hospital
0              Wallace-Hamilton
1     Burke, Griffin and Cooper
2                    Walton LLC
3                    Garcia Ltd
4       Jones, Brown and Murray
...                         ...
8634                  Moran Ltd
8635   Wood, Martin and Simmons
8636               Nash-Krueger
8637               Wilson-Lyons
8638  Torres, Young and Stewart

[8639 rows x 1 columns]

In [307]:
hospital_df['location']=[random.randint(0,50) for k in hospital_df.index]
hospital_df

                       hospital  location
0              Wallace-Hamilton        46
1     Burke, Griffin and Cooper        16
2                    Walton LLC        14
3                    Garcia Ltd        22
4       Jones, Brown and Murray        48
...                         ...       ...
8634                  Moran Ltd        35
8635   Wood, Martin and Simmons        28
8636               Nash-Krueger        39
8637               Wilson-Lyons        23
8638  Torres, Young and Stewart        13

[8639 rows x 2 columns]

In [308]:
merge_mc_location.nunique()

hospital        5749
location          34
State             51
Abbreviation      51
dtype: int64

In [309]:
merge_mc_location=hospital_df.merge(location_df, how='right')

In [310]:
location_clean=merge_mc_location.drop(columns=['location', 'Abbreviation'])
location_clean.rename(columns={"State": "location"}, inplace=True)

In [311]:
location_clean.to_sql(name='hospital', con=engine, if_exists='append', index=False)

8594

In [312]:
medication_uniq=df.medication.unique()
medication_uniq

array(['Aspirin', 'Lipitor', 'Penicillin', 'Paracetamol', 'Ibuprofen'],
      dtype=object)

In [313]:
medication_df = pd.DataFrame(medication_uniq)
medication_df.columns=['medication']
medication_df
medication_df.to_sql(name='medication', con=engine, if_exists='append', index=False)

5

In [314]:
admission_type_uniq=df.admission_type.unique()
admission_type_uniq

array(['Elective', 'Emergency', 'Urgent'], dtype=object)

In [315]:
adm_type_uniq_df = pd.DataFrame(admission_type_uniq)
adm_type_uniq_df.columns=['admission_type']
adm_type_uniq_df
adm_type_uniq_df.to_sql(name='admission_type', con=engine, if_exists='append', index=False)

3

In [316]:
test_result_uniq=df.test_result.unique()
test_result_uniq

array(['Inconclusive', 'Normal', 'Abnormal'], dtype=object)

In [317]:
testresult_df = pd.DataFrame(test_result_uniq)
testresult_df.columns=['test_result']
testresult_df
testresult_df.to_sql(name='test_results', con=engine, if_exists='append', index=False)

3

In [318]:
df.sample()

,name,age,gender,blood_type,medical_cond,adm_date,doctor,hospital,insurance_prov,billing_amount,room_number,admission_type,disc_date,medication,test_result
1316,Robert Campbell,66,Female,O+,Arthritis,2023-02-17,Jacob Washington,"Preston, Miller and Palmer",UnitedHealthcare,9526.488496,317,Urgent,2023-03-16,Penicillin,Inconclusive

In [319]:
doctor_uniq=df.doctor.unique()
doctor_uniq

array(['Patrick Parker', 'Diane Jackson', 'Paul Baker', ...,
       'Robert Nicholson', 'Jamie Lewis', 'Tasha Avila'], dtype=object)

In [320]:
doctor_data = pd.DataFrame(doctor_uniq)
doctor_data.columns=['doctor']
doctor_data
doctor_data.to_sql(name='doctor', con=engine, if_exists='append', index=False)

9416

In [321]:
insur_provider_uniq=df.insurance_prov.unique()
insur_provider_uniq

array(['Medicare', 'UnitedHealthcare', 'Aetna', 'Cigna', 'Blue Cross'],
      dtype=object)

In [322]:
insur_provider_data = pd.DataFrame(insur_provider_uniq)
insur_provider_data.columns=['insurance_prov']
insur_provider_data
insur_provider_data.to_sql(name='insurance_prov', con=engine, if_exists='append', index=False)

5

##complicated ones

### patient

In [323]:
bt_id_retrieve=pd.read_sql_query('''
    select * from bloodtype;''', engine
)
bt_id_retrieve

   blood_id blood_type
0         7         A-
1         5         A+
2         6        AB-
3         4        AB+
4         3         B-
5         8         B+
6         1         O-
7         2         O+

In [324]:
mc_id_retrieve=pd.read_sql_query('''
    select * from medicalcond;''', engine
)
mc_id_retrieve

   medcond_id  medical_cond
0           4     Arthritis
1           2        Asthma
2           6        Cancer
3           1      Diabetes
4           5  Hypertension
5           3       Obesity

In [325]:
patient_data = df[['name','age','gender', 'blood_type', 'medical_cond']]
patient_data

                      name  age  gender blood_type medical_cond
0          Tiffany Ramirez   81  Female         O-     Diabetes
1              Ruben Burns   35    Male         O+       Asthma
2                Chad Byrd   61    Male         B-      Obesity
3        Antonio Frederick   49    Male         B-       Asthma
4      Mrs. Brandy Flowers   51    Male         O-    Arthritis
...                    ...  ...     ...        ...          ...
9995            James Hood   83    Male         A+      Obesity
9996       Stephanie Evans   47  Female        AB+    Arthritis
9997  Christopher Martinez   54    Male         B-    Arthritis
9998           Amanda Duke   84    Male         A+    Arthritis
9999             Eric King   20    Male         B-    Arthritis

[10000 rows x 5 columns]

In [326]:
merge_bt_pats= pd.merge(patient_data, bt_id_retrieve, on='blood_type')
merge_bt_pats

                      name  age  gender blood_type medical_cond  blood_id
0          Tiffany Ramirez   81  Female         O-     Diabetes         1
1              Ruben Burns   35    Male         O+       Asthma         2
2                Chad Byrd   61    Male         B-      Obesity         3
3        Antonio Frederick   49    Male         B-       Asthma         3
4      Mrs. Brandy Flowers   51    Male         O-    Arthritis         1
...                    ...  ...     ...        ...          ...       ...
9995            James Hood   83    Male         A+      Obesity         5
9996       Stephanie Evans   47  Female        AB+    Arthritis         4
9997  Christopher Martinez   54    Male         B-    Arthritis         3
9998           Amanda Duke   84    Male         A+    Arthritis         5
9999             Eric King   20    Male         B-    Arthritis         3

[10000 rows x 6 columns]

In [327]:
merge_mc_pats= pd.merge(merge_bt_pats, mc_id_retrieve, on='medical_cond')
merge_mc_pats

,name,age,gender,blood_type,medical_cond,blood_id,medcond_id
0,Tiffany Ramirez,81,Female,O-,Diabetes,1,1
1,Ruben Burns,35,Male,O+,Asthma,2,2
2,Chad Byrd,61,Male,B-,Obesity,3,3
3,Antonio Frederick,49,Male,B-,Asthma,3,2
4,Mrs. Brandy Flowers,51,Male,O-,Arthritis,1,4
...,...,...,...,...,...,...,...
9995,James Hood,83,Male,A+,Obesity,5,3
9996,Stephanie Evans,47,Female,AB+,Arthritis,4,4
9997,Christopher Martinez,54,Male,B-,Arthritis,3,4
9998,Amanda Duke,84,Male,A+,Arthritis,5,4
9999,Eric King,20,Male,B-,Arthritis,3,4

In [328]:
patient_data_clean=merge_mc_pats.drop(columns=['blood_type', 'medical_cond'])
patient_data_clean

                      name  age  gender  blood_id  medcond_id
0          Tiffany Ramirez   81  Female         1           1
1              Ruben Burns   35    Male         2           2
2                Chad Byrd   61    Male         3           3
3        Antonio Frederick   49    Male         3           2
4      Mrs. Brandy Flowers   51    Male         1           4
...                    ...  ...     ...       ...         ...
9995            James Hood   83    Male         5           3
9996       Stephanie Evans   47  Female         4           4
9997  Christopher Martinez   54    Male         3           4
9998           Amanda Duke   84    Male         5           4
9999             Eric King   20    Male         3           4

[10000 rows x 5 columns]

In [329]:
patient_data_clean.to_sql(name='patient', con=engine, if_exists='append', index=False)

10000

### admissions

In [330]:
doc_id_retrieve=pd.read_sql_query('''
    select * from doctor;''', engine
)

hosp_id_retrieve=pd.read_sql_query('''
    select * from hospital;''', engine
)

admtype_id_retrieve=pd.read_sql_query('''
    select * from admission_type;''', engine
)

pat_id_retrieve=pd.read_sql_query('''
    select pat_id, name from patient;''', engine
)

meds_id_retrieve=pd.read_sql_query('''
    select * from medication;''', engine
)

testres_id_retrieve=pd.read_sql_query('''
    select * from test_results;''', engine
)

insprov_id_retrieve=pd.read_sql_query('''
    select * from insurance_prov;''', engine
)

In [331]:
admission_data = df[['adm_date','disc_date', 'room_number','billing_amount', 'doctor', 'hospital', 'admission_type', 'name', 'medication', 'test_result', 'insurance_prov']]
admission_data.sample()
admission_data.count()

adm_date          10000
disc_date         10000
room_number       10000
billing_amount    10000
doctor            10000
hospital          10000
admission_type    10000
name              10000
medication        10000
test_result       10000
insurance_prov    10000
dtype: int64

In [332]:
merge_doc_adm= pd.merge(admission_data, doc_id_retrieve, on='doctor')
merge_hosp_adm= pd.merge(merge_doc_adm, hosp_id_retrieve, on='hospital')
merge_admtype_adm= pd.merge(merge_hosp_adm, admtype_id_retrieve, on='admission_type')
merge_pat_adm= pd.merge(merge_admtype_adm, pat_id_retrieve, on='name')
merge_meds_adm= pd.merge(merge_pat_adm, meds_id_retrieve, on='medication')
merge_testres_adm= pd.merge(merge_meds_adm, testres_id_retrieve, on='test_result')
merge_insprov_adm= pd.merge(merge_testres_adm, insprov_id_retrieve, on='insurance_prov')

In [333]:
admission_data_clean=merge_insprov_adm.drop(columns=[ 'hospital','admission_type','medication','test_result','name','insurance_prov','doctor','location'])
admission_data_clean

,adm_date,disc_date,room_number,billing_amount,doctor_id,hospital_id,admtype_id,pat_id,meds_id,testres_id,insprov_id
0,2023-06-01,2023-06-15,404,47304.064845,2,6572,2,2,2,2,2
1,2023-06-01,2023-06-15,404,47304.064845,2,7107,2,2,2,2,2
2,2019-01-09,2019-02-08,292,36874.896997,3,1666,2,3,2,2,1
3,2019-01-09,2019-02-08,292,36874.896997,3,6924,2,3,2,2,1
4,2019-01-09,2019-02-08,292,36874.896997,3,7742,2,3,2,2,1
...,...,...,...,...,...,...,...,...,...,...,...
11406,2022-01-06,2022-01-29,244,5995.717488,9413,3553,2,9997,5,2,5
11407,2022-07-01,2022-07-15,312,49559.202905,9414,5464,1,9998,5,2,5
11408,2022-07-01,2022-07-15,312,49559.202905,9414,6800,1,9998,5,2,5
11409,2022-07-01,2022-07-15,312,49559.202905,9414,8322,1,9998,5,2,5
11410,2023-03-22,2023-04-15,290,37223.965865,9416,510,2,10000,3,3,3

In [334]:
admission_data_clean.to_sql(name='admission', con=engine, if_exists='append', index=False)

11411